frontend/widgets/pollwidget/models/PollsQuery.php

SELECT * FROM `polls` WHERE (date_beg<='2016-12-19') AND (date_end>='2016-12-19')
---
    public function one($db = null)
    {
        return parent::one($db);