frontend/controllers/PollsResultController.php

    public function actionCreate() {
        $model = new PollsResult();

        /**
         * Let's prepare  more providers
         */
        $pollsProvider = Polls::find()
                ->where('date_beg<=:dateToday', ['dateToday' => date('Y-m-d')])
                ->andWhere('date_end>=:dateToday', ['dateToday' => date('Y-m-d')])
                ->one();
        $modelsaved = false;
        if ($model->load(Yii::$app->request->post())) {
            /**
             * fill attributes of model
             *
             */
            $model->id_user = Yii::$app->user->getId();
            $model->id_poll = $pollsProvider->id;
            $model->num = 1;

            if (is_array($model->id_answer)) {
                $answers = $model->id_answer;
                foreach ($answers as $id_answer) {
                    $modelMulti = new PollsResult();
                    $modelMulti->id_user = Yii::$app->user->getId();
                    $modelMulti->id_poll = $pollsProvider->id;
                    $modelMulti->num = 1;
                    $modelMulti->id_answer = $id_answer;

                    if (!$modelMulti->save()) {
---
INSERT INTO `polls_result` (`id_answer`, `id_user`, `id_poll`, `num`, `id`) VALUES (32, 1, 8, 1, NULL)