frontend/widgets/pollwidget/PollWidget.php

INSERT INTO `polls_result` (`id_user`, `id_poll`, `num`, `create_at`, `ip`, `host`, `id_answer`) VALUES (0, 8, 1, '2016-12-19 15:30:23', '::1', NULL, 32)
---
    private function createResult($model) {
        $modelsaved = false;
        $answers = $model->id_answer;
        foreach ($answers as $id_answer) {
            $modelMulti = new PollsResult();
            $modelMulti->id_user = $model->id_user;
            $modelMulti->id_poll = $model->id_poll;
            $modelMulti->num = $model->num;
            $modelMulti->create_at = $model->create_at;
            $modelMulti->ip = $model->ip;
            $modelMulti->host = $model->host;
            $modelMulti->id_answer = $id_answer;

            if (!$modelMulti->save()) {