frontend/models/HouseQuery.php

    public function all($db = null)
    {
        return parent::all($db);
---
SELECT * FROM `house`