frontend/models/PollsQuery.php

    public function one($db = null)
    {
        return parent::one($db);
---
SELECT * FROM `polls` WHERE (date_beg<='2016-12-11') AND (date_end>='2016-12-11')