frontend/models/PollsAnswersQuery.php

SELECT * FROM `polls_answers` WHERE id_poll=8
---
    public function all($db = null)
    {
        return parent::all($db);